### 데이터프레임 병합

In [1]:
import pandas as pd
import numpy as np

In [2]:
df = pd.DataFrame(np.arange(16).reshape((4, 4)),
                    index=['Ohio', 'Colorado', 'Utah', 'New York'],
                    columns=['one', 'two', 'three', 'four'])
df

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

### pd.concat 

행방향, 열방향 모두 데이터 병합 가능

- 디폴트 행방향 합침 --> 컬럼명 참조
- axis = 1 인수 사용시 컬럼으로 병합 --> 인덱스 참조

#### case1 : 데이터의 컬럼명 같고 인덱스 다름

In [58]:
add_table1 = pd.DataFrame(np.random.choice(100,16).reshape((4,4)),
                         index=['Hawaii', 'Washington', 'Seattle', 'Texas'],
                         columns=['one', 'two', 'three', 'four'])

In [59]:
add_table1

            one  two  three  four
Hawaii       92    7     17     1
Washington   49   21      4    64
Seattle      22    2     86    53
Texas        15   34     24    43

In [6]:
# concat 메서드 (컬럼명 같을 때)
pd.concat([df,add_table1])

            one  two  three  four
Ohio          0    1      2     3
Colorado      4    5      6     7
Utah          8    9     10    11
New York     12   13     14    15
Hawaii       63   70     13    96
Washington   41   16     52    48
Seattle      55   14     87    84
Texas        98   19     75    74

In [8]:
# concat 메서드 (컬럼명 같을 때) - axis 인수 사용
pd.concat([df,add_table1], axis=1)

             one   two  three  four   one   two  three  four
Ohio         0.0   1.0    2.0   3.0   NaN   NaN    NaN   NaN
Colorado     4.0   5.0    6.0   7.0   NaN   NaN    NaN   NaN
Utah         8.0   9.0   10.0  11.0   NaN   NaN    NaN   NaN
New York    12.0  13.0   14.0  15.0   NaN   NaN    NaN   NaN
Hawaii       NaN   NaN    NaN   NaN  63.0  70.0   13.0  96.0
Washington   NaN   NaN    NaN   NaN  41.0  16.0   52.0  48.0
Seattle      NaN   NaN    NaN   NaN  55.0  14.0   87.0  84.0
Texas        NaN   NaN    NaN   NaN  98.0  19.0   75.0  74.0

#### case2 : 데이터의 컬럼명 같고 인덱스 같음

In [10]:
add_table2 = pd.DataFrame(np.random.choice(100,16).reshape((4,4)),
                         index=['Ohio', 'Colorado', 'Utah', 'New York'],
                         columns=['one', 'two', 'three', 'four'])

In [12]:
# 디폴트 행 바인드
pd.concat([df,add_table2])

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15
Ohio       45   27     71    54
Colorado   26   58     70    87
Utah       65   20     30    20
New York   46   83     50    42

In [49]:
# 디폴트 행 바인드 : DataFrame.append()
df.append(add_table2)

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15
Ohio       45   27     71    54
Colorado   26   58     70    87
Utah       65   20     30    20
New York   46   83     50    42

In [13]:
# 컬럼 바인드
pd.concat([df,add_table2], axis = 1)

          one  two  three  four  one  two  three  four
Ohio        0    1      2     3   45   27     71    54
Colorado    4    5      6     7   26   58     70    87
Utah        8    9     10    11   65   20     30    20
New York   12   13     14    15   46   83     50    42

#### case3 : 데이터의 인덱스, 컬럼명 다름

In [14]:
# concat 메서드 (컬럼명 다를 때)

add_table3 = pd.DataFrame(np.random.choice(100,16).reshape((4,4)),
                         index=['Hawaii', 'Washington', 'Seattle', 'Texas'],
                         columns=['five', 'six', 'seven', 'eight'])

In [15]:
# 디폴트 행 바인드
pd.concat([df,add_table3])

             one   two  three  four  five   six  seven  eight
Ohio         0.0   1.0    2.0   3.0   NaN   NaN    NaN    NaN
Colorado     4.0   5.0    6.0   7.0   NaN   NaN    NaN    NaN
Utah         8.0   9.0   10.0  11.0   NaN   NaN    NaN    NaN
New York    12.0  13.0   14.0  15.0   NaN   NaN    NaN    NaN
Hawaii       NaN   NaN    NaN   NaN  65.0  67.0   12.0   80.0
Washington   NaN   NaN    NaN   NaN  39.0  27.0   60.0   27.0
Seattle      NaN   NaN    NaN   NaN  27.0  89.0   35.0   98.0
Texas        NaN   NaN    NaN   NaN  64.0  79.0    6.0   20.0

concat을 이용한 행 바인드시 컬럼명이 다르므로 밑으로 바로 병합해주지 못함

In [16]:
# 컬럼 바인드
pd.concat([df,add_table3], axis = 1)

             one   two  three  four  five   six  seven  eight
Ohio         0.0   1.0    2.0   3.0   NaN   NaN    NaN    NaN
Colorado     4.0   5.0    6.0   7.0   NaN   NaN    NaN    NaN
Utah         8.0   9.0   10.0  11.0   NaN   NaN    NaN    NaN
New York    12.0  13.0   14.0  15.0   NaN   NaN    NaN    NaN
Hawaii       NaN   NaN    NaN   NaN  65.0  67.0   12.0   80.0
Washington   NaN   NaN    NaN   NaN  39.0  27.0   60.0   27.0
Seattle      NaN   NaN    NaN   NaN  27.0  89.0   35.0   98.0
Texas        NaN   NaN    NaN   NaN  64.0  79.0    6.0   20.0

마찬가지로 컬럼 바인드 시에도 인덱스가 달라서 옆으로 병합 불가

#### Quiz) 아래와 같이 행이름 없는 데이터를 기존의 df와 컬럼 바인드 수행해보세요

In [37]:
add_table4 = pd.DataFrame(np.random.choice(100,16).reshape((4,4)),
                         columns=['five', 'six', 'seven', 'eight'])

In [38]:
add_table4

   five  six  seven  eight
0    41   99     35     69
1    27   71     11     24
2    84   46     35     12
3    87   86     89     67

### apply & applymap

In [54]:
add_table11 = pd.DataFrame(np.random.randn(4,3),
                           index=['Hawaii', 'Washington', 'Seattle', 'Texas'],
                           columns=['one', 'two', 'three'])

In [55]:
add_table11

                 one       two     three
Hawaii     -0.378331  0.585543 -0.638812
Washington -0.602630 -1.581030  1.070860
Seattle     1.471142  1.022005 -0.344325
Texas      -2.327327  0.171198 -0.590457

In [61]:
# 절대값
np.abs(add_table11)

                 one       two     three
Hawaii      0.378331  0.585543  0.638812
Washington  0.602630  1.581030  1.070860
Seattle     1.471142  1.022005  0.344325
Texas       2.327327  0.171198  0.590457

위 add_table11에서 컬럼별로 '최대값 - 최소값'을 구하고 싶다면?

In [62]:
a = add_table11['one'].max() - add_table11['one'].min()
b = add_table11['two'].max() - add_table11['two'].min()
c = add_table11['three'].max() - add_table11['three'].min()

a,b,c

(3.798468951202893, 2.603035114345971, 1.7096724145593396)

위 add_table11에서 행별로 '최대값 - 최소값'을 구하고 싶다면?

In [64]:
hw = add_table11.loc['Hawaii',:].max() - add_table11.loc['Hawaii',:].min()
hw

1.2243553408224446

apply()와 람다표현식을 적용하여 간단히 해결

In [81]:
f = lambda x: x.max() - x.min()

In [84]:
# 디폴트 행축으로 연산
add_table11.apply(f)

one      3.798469
two      2.603035
three    1.709672
dtype: float64

In [68]:
# 컬럼간 연산
add_table11.apply(f, axis = 1)

Hawaii        1.224355
Washington    2.651890
Seattle       1.815467
Texas         2.498525
dtype: float64

#### applymap method

In [104]:
lambda a, b, c: a + b + c

In [109]:
(lambda a, b, c: a + b + c)(1,2,3)

6

In [77]:
f2 = lambda x: '%.2f' % x

In [87]:
f2(10.872)

'10.87'

In [112]:
add_table12 = add_table11.applymap(f2)

In [117]:
add_table12['one']

Hawaii        -0.38
Washington    -0.60
Seattle        1.47
Texas         -2.33
Name: one, dtype: object

In [121]:
add_table12 # 문자열

              one    two  three
Hawaii      -0.38   0.59  -0.64
Washington  -0.60  -1.58   1.07
Seattle      1.47   1.02  -0.34
Texas       -2.33   0.17  -0.59

In [119]:
np.round(add_table11, 2) # 수치형

             one   two  three
Hawaii     -0.38  0.59  -0.64
Washington -0.60 -1.58   1.07
Seattle     1.47  1.02  -0.34
Texas      -2.33  0.17  -0.59